"""
Представлен список чисел. Определите элементы списка, не имеющие повторений.
Сформируйте итоговый массив чисел, соответствующих требованию. Элементы выведите в
порядке их следования в исходном списке. Для выполнения задания обязательно используйте генератор.
Пример исходного списка: [2, 2, 2, 7, 23, 1, 44, 44, 3, 2, 10, 7, 4, 11].
Результат: [23, 1, 3, 10, 4, 11]
"""


from random import randint


my_list = [randint(-10, 10) for _ in range(20)]
new_list = [el for el in my_list if my_list.count(el) == 1]
print(f'Исходный список\n{my_list}')
print(f'Список без повторений\n{new_list}')
